{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_4": {"name": "input_layer_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/Cast_1/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/flatten_4_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "61504"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/mul", "op": "Mul", "input": ["input_layer_4", "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/mul", "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/add", "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/convolution/ReadVariableOp", "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/max_pooling2d_8_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/BiasAdd"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/max_pooling2d_8_1/MaxPool2d", "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/convolution/ReadVariableOp", "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/max_pooling2d_9_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/BiasAdd"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/flatten_4_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/max_pooling2d_9_1/MaxPool2d", "StatefulPartitionedCall/Lie_Truth_Model_2_1/flatten_4_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/flatten_4_1/Reshape", "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/Relu", "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/Cast/ReadVariableOp", "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/rescaling_4_1/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_8_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/conv2d_9_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/flatten_4_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/Cast/ReadVariableOp", "shape": [61504, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_7_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/Cast/ReadVariableOp", "shape": [64, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Lie_Truth_Model_2_1/dense_8_1/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}